var data=[];
var dataStr = 
'1、当幸福来敲门<br>\
<br>\
当人们做不到一些事情的时候，他们就会对你说你也同样不能。<br>\
如果你有梦想的话，就要去捍卫它。<br>\
当你最认为困难的时候，其实就是你最接近成功的时候。<br>\
以后连朋友都不做了？ ---没法儿做，太相爱的人怎么做朋友<br>\
机会总是留给有准备的人，但那往往是努力的人剩下来的。<br>\
<br>\
<br>\
2、蝙蝠侠黑暗骑士<br>\
<br>\
《黑暗骑士》（The Dark Knight）改编自DC漫画公司的经典超级英雄漫画《蝙蝠侠》，<br>\
由克里斯托弗·诺兰执导，克里斯蒂安·贝尔主演，于2008年全球公映。<br>\
影片是蝙蝠侠黑暗骑士三部曲的第二部作品，前作为2005年上映的《蝙蝠侠：开战时刻》。本片是所有蝙蝠侠电影中第一次没有在片名中使用“蝙蝠侠”这个词的，<br>\
是比前作更为黑暗与成熟的作品，以现实主义警匪片的手法包装了一个极度写实的超级英雄故事,成功地挖掘出角色的深层性格和故事蕴含的人性哲理，将漫画电影提升到一个崭新的层次，成为了影史上第一部跨入10亿美元俱乐部的超级英雄电影。<br>\
<br>\
<br>\
3、后天<br>\
<br>\
《后天》（The day after tomorrow）为20世纪福克斯公司的年度科幻巨片，投资1.25亿美元，<br>\
由曾经执导《独立日》、《爱国者》等片的导演罗兰·艾默里奇执导，<br>\
新生代偶像丹尼斯·奎德、杰克·吉伦哈尔、艾米·罗森、莎拉·沃德等主演。影片讲述温室效应造成地球气候异变，<br>\
全球即将陷入第二次冰河纪的故事。北半球因温室效应引起冰山融化，地球进入第二冰河期，<br>\
龙卷风、海啸、地震在全球肆虐，整个纽约陷入冰河的包围中。<br>\
<br>\
<br>\
4、杀人回忆<br>\
<br>\
电影《杀人回忆》是由奉俊昊执导，宋康昊、金相庆、朴海日等人主演的犯罪悬疑片。<br>\
该片取材于20世纪80年代中后期令韩国社会陷入一片恐慌的韩国华城连环杀人案，<br>\
1996年首次经金光林导演拍摄成舞台剧‘Come and See Me’，<br>\
本片在此基础上并根据实际调查资料与采访记录等进行改编。<br>\
影片于2003年5月2日在韩国上映。电影讲述的是在韩国的一个小镇上,出现了一系列的连环杀人案，被害人都是年轻女子。<br>\
小镇警察和从汉城调来的苏警察共同办案。小镇警察作风粗暴，刑讯逼供，几次将犯罪嫌疑人屈打成招。汉城 ... <br>\
<br>\
<br>\
5、黄海<br>\
<br>\
《黄海》是由罗宏镇编导，金允石、河正宇、赵成夏主演的一部韩国动作片。<br>\
影片该片讲述一名为了逃债而偷渡到韩国成为杀手的男人与追杀这名男子的另外一个杀手的故事。<br>\
该片于2010年12月22日在韩国上映。<br>\
该片获得第47届韩国百想艺术大赏最佳影片、<br>\
第48届韩国电影大钟奖最佳影片提名。<br>\
<br>\
<br>\
6、恐怖直播<br>\
<br>\
电影《恐怖直播》是由金秉宇导演，河正宇、李景荣主演，<br>\
韩国Lotte Entertainment公司发行的电影。<br>\
故事聚焦首尔汉江上发生的一连串炸弹恐怖事件。<br>\
广播主持尹英华在节目中接到神秘听众打来的威胁电话，<br>\
尹英华意识到这个神秘听众很可能就是汉江连锁炸弹恐怖事件的元凶后，<br>\
意图将该事件制作为一档能够令自己咸鱼翻身的独家直播节目，<br>\
但事件的发展却远远超出了他的想象。本片以35亿韩元的制作费，<br>\
仅上映6天就突破了200万人的盈亏分界线。<br>\
<br>\
<br>\
7、无间道<br>\
<br>\
《无间道》是寰亚电影发行公司于2002年出品的一部警匪片，<br>\
由刘伟强、麦兆辉执导，刘德华、梁朝伟、黄秋生、曾志伟等主演。<br>\
该片讲述的是两个身份混乱的男人分别为警方和黑社会的卧底，<br>\
经过一场激烈的角斗，他们决心要寻回自己的故事。<br>\
2003年，该片获得了第22届香港电影金像奖最佳电影奖、<br>\
第40届台湾电影金马奖最佳影片等奖项，<br>\
梁朝伟凭借该片获得第22届香港电影金像奖最佳男主角奖等奖项<br>\
<br>\
<br>\
8、绣春刀<br>\
<br>\
《绣春刀》是中国电影股份有限公司、中央新闻纪录电影制片厂（集团）、<br>\
北京大楚长歌影视文化有限公司、北京合力映画影视文化传媒有限公司<br>\
联合出品的浪漫武侠电影，由路阳执导，张震、刘诗诗、<br>\
王千源、李东学、聂远、金士杰等主演。该片讲述了明末崇祯年间，<br>\
锦衣卫三兄弟奉命追杀魏忠贤，最后却卷入到一场宫廷阴谋当中的充满悬疑的故事。<br>\
2014年8月7日于中国内地上映。2015年10月31日，<br>\
该片获得第十五届华语电影传媒大奖最受瞩目电影。<br>\
<br>\
<br>\
9、寒战<br>\
<br>\
《寒战》是银都机构有限公司、万诱引力丁有限公司、<br>\
安乐影片有限公司联合出品的动作电影，由梁乐民、陆剑青执导，<br>\
郭富城、梁家辉、杨采妮领衔主演。该片讲述了在新时代背景下，<br>\
一辆价值不菲的警察冲锋车被劫持，随之整个香港都陷入到安全危机，<br>\
警匪之间展开高智商较量。2012年10月4日，作为韩国釜山电影节的开幕影片全球首映，<br>\
11月8日在中国大陆和香港同时上映。2013年该片获得香港电影金像奖最佳影片等诸多奖项。<br>\
<br>\
<br>\
10、阿甘正传<br>\
<br>\
《阿甘正传》是由罗伯特·泽米吉斯执导的电影，<br>\
由汤姆·汉克斯、罗宾·怀特等人主演，于1994年7月6日在美国上映。<br>\
电影改编自美国作家温斯顿·格卢姆于1986年出版的同名小说，<br>\
描绘了先天智障的小镇男孩福瑞斯特·甘自强不息，<br>\
最终“傻人有傻福”地得到上天眷顾，在多个领域创造奇迹的励志故事。<br>\
电影上映后，于1995年获得奥斯卡最佳影片奖、最佳男主角奖、最佳导演奖等6项大奖。<br>\
2014年9月5日，在该片上映20周年之际，《阿甘正传》IMAX版本开始在全美上映。<br>\
';
var moves=dataStr.split("<br><br><br>");
for(var i=0;i<moves.length;i++){
	var m=moves[i].split("<br><br>");
	data.push({
		img:m[0].replace("、","")+".jpg",
		caption:m[0].split("、")[1],
		desc:m[1]
	});
}
